package com.huida.zsxs.bean;

import java.util.List;

/**
 * Created by xiaojiu on 2017/6/25.
 */

public class GetZTShowBean {

    /**
     * content : 内容
     * imgURL : http://www.chinaplat.com/imgzt/IMG-20170517/2017051709210946946.jpg
     * page_all : 1
     * page_now : 1
     * ZTtitle : 省考专题
     * Course : [{"kc_id":"119453","title":"公务员笔试行测精讲--资料分析","img":"http://www.chinaplat.com/CourseImg/IMG-20170410/20170410105845314531.jpg","info":"公务员笔试行测精讲--资料分析视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。","money":5000,"keshi":13,"hot":7291},{"kc_id":"119460","title":"2016行测精讲--言语理解与表达","img":"http://www.chinaplat.com/CourseImg/IMG-20160105/20160105152072307230.png","info":"2016行测精讲--语言理解与表达视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。","money":6000,"keshi":38,"hot":5011},{"kc_id":"119436","title":"公务员笔试行测精讲--数量关系","img":"http://www.chinaplat.com/CourseImg/IMG-20170410/20170410111260996099.jpg","info":"公务员笔试行测精讲--数量关系视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。 ","money":5000,"keshi":27,"hot":4651},{"kc_id":"119455","title":"公务员笔试行测精讲--判断推理","img":"http://www.chinaplat.com/CourseImg/IMG-20170410/20170410110129802980.jpg","info":"公务员笔试行测精讲--判断推理视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。","money":5000,"keshi":39,"hot":3321},{"kc_id":"119458","title":"公务员笔试行测精讲--常识判断","img":"http://www.chinaplat.com/CourseImg/IMG-20170410/20170410110653245324.jpg","info":"公务员笔试行测精讲--常识判断视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。","money":5000,"keshi":33,"hot":3877},{"kc_id":"119456","title":"2016最新公考教程\u2014申论","img":"http://www.chinaplat.com/CourseImg/IMG-20160106/20160106142584638463.png","info":"视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。","money":16000,"keshi":63,"hot":4067},{"kc_id":"119269","title":"申论学习从入门到精通","img":"http://www.chinaplat.com/CourseImg/IMG-20160114/20160114134412641264.png","info":"申论学习从入门到精通视频教程助你7天申论考试稳拿81分。本教程从申论考试的规律；申论题型的详尽解析；申论备考的三大法宝等方面细致讲授考试技巧。全套课程总共22个视频，每个课时30分钟的时间，全部学完仅需11个小时。但是，建议你认认真真反复的看三遍！你的申论水平将会发生翻天覆地的变化。","money":199,"keshi":22,"hot":2197},{"kc_id":"119533","title":"公文写作-概述","img":"http://www.chinaplat.com/CourseImg/IMG-20151226/20151226172714501450.jpg","info":"公文写作又叫应用文写作是常考五大题型之一，本课程讲授了公文写作的定义，以及公文写作的作答要求，考察的形式及类型等。授课内容通俗易懂，易于考生理解和接受，帮助考生更好的为考试做准备。","money":1000,"keshi":1,"hot":1200},{"kc_id":"119532","title":"公文写作-讲话稿","img":"http://www.chinaplat.com/CourseImg/IMG-20151226/20151226171454115411.jpg","info":"公文写作之讲话稿部分视频教程主要讲授了讲话稿的定义，讲话稿有广义和狭义之分。广义的讲话稿是人们在特定场合发表讲话的文稿;狭义的讲话稿即一般所说的领导讲话稿，是各级领导在各种会议上发表带有宣传、指示、总结性质讲话的文稿。是应用写作研究的重要文体之一。讲话稿能力在机关工作中必不可少，因此老师为大家总结了讲话稿的写作技巧，帮助考生更好掌握考试技巧。 ","money":1000,"keshi":1,"hot":432},{"kc_id":"119529","title":"公文写作-公开信","img":"http://www.chinaplat.com/CourseImg/IMG-20151226/20151226170175887588.jpg","info":"公文写作之公开信部分视频教程主要讲授了公文写作的文种介绍，写作要求，真题精讲三部分，内容细致，通俗易懂，可帮助考生快速掌握公开信的写作技巧。","money":1000,"keshi":1,"hot":362},{"kc_id":"119535","title":"公文写作-倡议书","img":"http://www.chinaplat.com/CourseImg/IMG-20151226/20151226173192499249.jpg","info":"公文写作之倡议书部分视频教程主要讲授了倡议书的定义，倡议书的组成部分（标题，称呼，正文内容，结尾，落款），真题精讲，通俗易懂，帮助考生更好理解与接受，更好把握考试考点，取得写作高分。","money":1000,"keshi":1,"hot":359},{"kc_id":"119531","title":"公文写作-指导意见","img":"http://www.chinaplat.com/CourseImg/IMG-20151226/20151226171029932993.jpg","info":"公文写作之指导意见部分视频教程由经验丰富老师通过对真题的全面耐心细致讲解让考生更好理解指导意见考试考点，从文种类型，写作要求，到真题精讲等方面精准把握考试考点，帮助考生积极备考。","money":1000,"keshi":1,"hot":326},{"kc_id":"119523","title":"公文写作-创新题型","img":"http://www.chinaplat.com/CourseImg/IMG-20151226/20151226163027042704.jpg","info":"在公文写作中，可以见到这样的一种题型，要求考生根据给定材料写一篇评论性的小文章，我们称之为\u201c评论类文章\u201d或\u201c小评论\u201d也称之为短评，短评其实为短文的一种特殊形式，近年来考察较多，因此中仕学社特邀资深老师为大家总结了该考点的考试技巧，以帮助考生更好的了解考试方向，取得满意成绩。","money":2000,"keshi":2,"hot":463}]
     */

    public String content;
    public String imgURL;
    public int page_all;
    public int page_now;
    public String ZTtitle;
    public List<CourseBean> Course;
    

    public static class CourseBean {
        /**
         * kc_id : 119453
         * title : 公务员笔试行测精讲--资料分析
         * img : http://www.chinaplat.com/CourseImg/IMG-20170410/20170410105845314531.jpg
         * info : 公务员笔试行测精讲--资料分析视频教程深度体现时代精神和公考趋势，全面系统讲授考试高分策略，具有高度前瞻性和时效性，考生可在完美的课程方案和名师指导下系统提高，加速复习的效率。通过系统性的学习和实战训练，全面提高能力，具备高分通过的实力。
         * money : 5000
         * keshi : 13
         * hot : 7291
         */

        public String kc_id;
        public String title;
        public String img;
        public String info;
        public int money;
        public int keshi;
        public int hot;
        
    }
}
